DataProcessors/бит_ЗаполнениеКвартир.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗаполнениеКвартир</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолвоКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКвартир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныКвартир</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_СведенияОКомнате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКомнате</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комната</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ШаблоныКвартир.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныКвартир</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Комнаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_НазначениеЧастейПомещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_Комнаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_Комнаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_Квартиры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКомнаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастьПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НазначениеЧастейПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКвартир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныКвартир</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КадастровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденоПоставщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/бит_ЗаполнениеКвартир/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация" ,Объект.Организация);
	Параметры.Свойство("Здание"		 ,Объект.Здание);
	Параметры.Свойство("НаДату"		 ,Объект.НаДату);
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация =  бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НаДату) Тогда
		Объект.НаДату = ТекущаяДата();
	КонецЕсли; 
	
	Если НЕ Параметры.Свойство("Квартира") 
		И ЗначениеЗаполнено(Объект.Организация) 
		И ЗначениеЗаполнено(Объект.Здание) Тогда
		
		СписокКвартир.Очистить();
		СКвартир = СписокКвартир;
		Отборы = Новый Структура("Организация, Здание, НаДату, КолвоКомнат"
								, Объект.Организация, Объект.Здание, Объект.НаДату, Объект.КолвоКомнат);
		УстановитьОтборСписокКвартирСервер(Отборы, СКвартир);
		КопироватьДанныеФормы(СКвартир,СписокКвартир);
	ИначеЕсли Параметры.Свойство("Квартира") Тогда
		
		ТекДанные = СписокКвартир.Добавить();
		ТекДанные.Квартира 					= Параметры.Квартира;
		ТекДанные.ПрименятьНастройкиФлаг 	= Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СписокКвартир.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	СписокКвартир.Очистить();
	СКвартир = СписокКвартир;
	Отборы = Новый Структура("Организация, Здание, НаДату, КолвоКомнат"
							, Объект.Организация, Объект.Здание, Объект.НаДату, Объект.КолвоКомнат);
	УстановитьОтборСписокКвартирСервер(Отборы, СКвартир);
	КопироватьДанныеФормы(СКвартир,СписокКвартир);
	
КонецПроцедуры

&НаКлиенте
Процедура КолвоКомнатПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Здание)
		И ЗначениеЗаполнено(Объект.Организация) Тогда
		
		СписокКвартир.Очистить();
		СКвартир = СписокКвартир;
		Отборы = Новый Структура("Организация, Здание, НаДату, КолвоКомнат"
								, Объект.Организация, Объект.Здание, Объект.НаДату, Объект.КолвоКомнат);
		УстановитьОтборСписокКвартирСервер(Отборы, СКвартир);
		КопироватьДанныеФормы(СКвартир,СписокКвартир);
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Необходимо заполнить обязательные реквизиты формы (Организация, Здание)!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ШаблонКвартирПриИзменении(Элемент)
	
	НастройкиШаблона.Очистить();
	Если ЗначениеЗаполнено(Объект.ШаблонКвартир) Тогда
			
		НШаблона = НастройкиШаблона;
		ЗаполнитьНастройкиШаблонаСервер(Объект.ШаблонКвартир, НШаблона);
		КопироватьДанныеФормы(НШаблона,НастройкиШаблона);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКвартир

&НаКлиенте
Процедура СписокКвартирПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекКв = Элемент.ТекущиеДанные.Квартира;
	
	Если ЗначениеЗаполнено(ТекКв) Тогда
		
		СписокКомнат.Очистить();
		СКомнаты = СписокКомнат;
		Отборы = Новый Структура("ТекКв, НаДату", ТекКв, Объект.НаДату);
		УстановитьОтборСписокКомнатСервер(Отборы, СКомнаты);
		КопироватьДанныеФормы(СКомнаты,СписокКомнат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКомнат

&НаКлиенте
Процедура СписокКомнатПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		ТекДанные    = Элемент.ТекущиеДанные;
		НовыйЭлемент = ТекДанные.Ссылка.Скопировать();
	Иначе
		Отказ = Истина;
		СтрВладельца = Элементы.СписокКвартир.ТекущиеДанные;
		Если НЕ СтрВладельца = Неопределено 
			И ЗначениеЗаполнено(СтрВладельца.Квартира) Тогда
			СоздатьКомнатуНаСервере(СтрВладельца.Квартира);		
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура снятия флажков в поле СписокКвартир столбце ПрименятьНастройкиФлаг.
&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого Строка Из СписокКвартир Цикл
		Строка.ПрименятьНастройкиФлаг = Ложь; 
	КонецЦикла;
	
КонецПроцедуры

// Процедура установки флажков в поле СписокКвартир столбце ПрименятьНастройкиФлаг.
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого Строка Из СписокКвартир Цикл
		Строка.ПрименятьНастройкиФлаг = Истина; 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура формирования списка квартир.
&НаСервереБезКонтекста
Процедура УстановитьОтборСписокКвартирСервер(Отборы, СКвартир)
	
	ТекстЗапрос = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_Квартиры.Ссылка КАК Квартира
	|ИЗ
	|	Справочник.бит_Квартиры КАК бит_Квартиры
	|ГДЕ
	|	бит_Квартиры.Владелец = &Владелец
	|	И бит_Квартиры.Владелец.Организация = &Организация";
	
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапрос);
	Если Отборы.КолвоКомнат > 0 Тогда
		ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора = ЗапросСхемы.Операторы[0];
		ОператорВыбора.Отбор.Добавить("бит_Квартиры.КоличествоКомнат = &КоличествоКомнат");
	КонецЕсли;
	
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Владелец"		, Отборы.Здание);
	Запрос.УстановитьПараметр("Организация"		, Отборы.Организация);
	Запрос.УстановитьПараметр("Момент"			, Отборы.НаДату);
	
	Если Отборы.КолвоКомнат > 0 Тогда
		Запрос.УстановитьПараметр("КоличествоКомнат", Отборы.КолвоКомнат);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабКвартир = ДанныеФормыВЗначение(СКвартир, Тип("ТаблицаЗначений"));
	Пока Выборка.Следующий() Цикл
			ТекДанные = ТабКвартир.Добавить();
			ТекДанные.Квартира 					= Выборка.Квартира;
			ТекДанные.ПрименятьНастройкиФлаг 	= Истина;
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ТабКвартир, СКвартир);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНастройкиШаблонаСервер(ШаблонКвартир, НШаблона)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ШаблоныКвартирКомнаты.НомерСтроки,
	|	бит_ШаблоныКвартирКомнаты.Комната
	|ИЗ
	|	Справочник.бит_ШаблоныКвартир.Комнаты КАК бит_ШаблоныКвартирКомнаты
	|ГДЕ
	|	бит_ШаблоныКвартирКомнаты.Ссылка = &ШаблонКвартир";	
	
	Запрос.УстановитьПараметр("ШаблонКвартир", ШаблонКвартир);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабНастройкиШаблона = ДанныеФормыВЗначение(НШаблона, Тип("ТаблицаЗначений"));
	Пока Выборка.Следующий() Цикл
		НоваяСтрока				= ТабНастройкиШаблона.Добавить();
		НоваяСтрока.НомерСтроки = Выборка.НомерСтроки;
		НоваяСтрока.Комната 	= Выборка.Комната;
	КонецЦикла; 
	
	ЗначениеВДанныеФормы(ТабНастройкиШаблона, НШаблона);

КонецПроцедуры	

&НаСервереБезКонтекста
Процедура СоздатьКомнатуНаСервере(Владелец)
	
	НовыйЭлемент = Справочники.бит_Комнаты.СоздатьЭлемент();
	НовыйЭлемент.Владелец = Владелец;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОтборСписокКомнатСервер(Отборы, СКомнат)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_Комнаты.НомерКомнаты КАК НомерКомнаты,
	|	бит_Комнаты.Наименование КАК Комната,
	|	бит_Комнаты.ЧастьПомещения КАК ЧастьПомещения,
	|	бит_СведенияОКомнатеСрезПоследних.Высота,
	|	бит_СведенияОКомнатеСрезПоследних.Площадь,
	|	бит_Комнаты.ШаблонКвартир КАК ШаблонКвартир,
	|	бит_Комнаты.Владелец КАК Владелец
	|ИЗ
	|	Справочник.бит_Комнаты КАК бит_Комнаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКомнате.СрезПоследних(&Момент, Комната.Владелец = &Квартира) КАК бит_СведенияОКомнатеСрезПоследних
	|		ПО (бит_СведенияОКомнатеСрезПоследних.Комната = бит_Комнаты.Ссылка)
	|ГДЕ
	|	бит_Комнаты.Владелец = &Квартира";
	
	Запрос.УстановитьПараметр("Квартира", Отборы.ТекКв);
	Запрос.УстановитьПараметр("Момент"	, Отборы.НаДату);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабКомнат = ДанныеФормыВЗначение(СКомнат, Тип("ТаблицаЗначений"));
	Пока Выборка.Следующий() Цикл
		НСтр = ТабКомнат.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Выборка);
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ТабКомнат, СКомнат);
	
КонецПроцедуры

#КонецОбласти
